Workspace/run/15-sineWaveDamping-backward-pressureOutletNSCBCd-3000hz-temperatureOutletNSCBC-0hz-velocityOutletNSCBC-zerogradinetInlet-amplitude-1/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication $(getApplication)
postProcess -s sample postProcess -func sample -noZero
#------------------------------------------------------------------------------
