Workspace/run/15-sineWaveDamping-backward-pressureOutletNSCBCd-3000hz-temperatureOutletNSCBC-0hz-velocityOutletNSCBC-zerogradinetInlet-amplitude-1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
( 
    volVectorFieldValue U (0 0 0) 
    volScalarFieldValue T 300
    volScalarFieldValue p 101325
);

regions         
( 
    boxToCell 
    { 
        box (0 -1 -1) (2 1 1) ; 
        fieldValues 
        (
            volScalarFieldValue T 300
            volScalarFieldValue p 101325
        ); 
     } 
);

// ************************************************************************* //
